[
  {
    "date": "2025-11-10",
    "reference": "Psalm 119:105",
    "text": "Thy word is a lamp unto my feet, and a light unto my path.",
    "translation": "KJV",
    "passage": "Summary: Scripture gives practical direction for daily life. Context: Psalm 119 celebrates the value of God's law as guidance. Application: When choices feel uncertain, look to foundational truths that illuminate the next step.",
    "importance": "Guidance for daily decisions"
  },
  {
    "date": "2025-11-11",
    "reference": "Hebrews 11:1",
    "text": "Now faith is the substance of things hoped for, the evidence of things not seen.",
    "translation": "KJV",
    "passage": "Summary: Faith trusts beyond current sight. Context: Hebrews 11 surveys faith-filled examples. Application: In seasons of waiting, lean on steady hope rather than immediate proof.",
    "importance": "Faith & remembrance (Veterans/Remembrance)"
  },
  {
    "date": "2025-11-12",
    "reference": "Galatians 5:22-23",
    "text": "But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith,\nMeekness, temperance: against such there is no law.",
    "translation": "KJV",
    "passage": "Summary: The Spirit cultivates character in believers. Context: Paul contrasts works of the flesh with Spirit fruit. Application: Seek these character traits in everyday relationships instead of quick victories.",
    "importance": "Character & relationships"
  },
  {
    "date": "2025-11-13",
    "reference": "Matthew 5:16",
    "text": "Let your light so shine before men, that they may see your good works, and glorify your Father which is in heaven.",
    "translation": "KJV",
    "passage": "Summary: Good deeds point others toward goodness. Context: Part of the Sermon on the Mount teaching about public witness. Application: Simple acts of kindness can make faith visible in everyday life.",
    "importance": "Be a light in the world"
  },
  {
    "date": "2025-11-14",
    "reference": "Ephesians 2:8-9",
    "text": "For by grace are ye saved through faith; and that not of yourselves: it is the gift of God:\nNot of works, lest any man should boast.",
    "translation": "KJV",
    "passage": "Summary: Salvation is a gift, not earned by achievement. Context: Paul emphasizes grace over legalistic boasting. Application: Receive humility and gratitude rather than measuring worth by performance.",
    "importance": "Grace & humility"
  },
  {
    "date": "2025-11-15",
    "reference": "1 Corinthians 13:4-7",
    "text": "Charity suffereth long, and is kind; charity envieth not; charity vaunteth not itself, is not puffed up,\nDoth not behave itself unseemly, seeketh not her own, is not easily provoked, thinketh no evil;\nRejoiceth not in iniquity, but rejoiceth in the truth;\nBeareth all things, believeth all things, hopeth all things, endureth all things.",
    "translation": "KJV",
    "passage": "Summary: Love is patient, kind, and enduring. Context: Paul's classic passage defining true love. Application: Let these qualities shape how you relate to family and friends today.",
    "importance": "Love and relationships"
  },
  {
    "date": "2025-11-16",
    "reference": "Jeremiah 29:11",
    "text": "For I know the thoughts that I think toward you, saith the LORD, thoughts of peace, and not of evil, to give you an expected end.",
    "translation": "KJV",
    "passage": "Summary: God has hopeful plans for the future. Context: Jeremiah's letter encourages exiles with a long-term promise. Application: Trust that setbacks can fit into a broader hopeful story.",
    "importance": "Hope & future planning"
  },
  {
    "date": "2025-11-17",
    "reference": "Psalm 46:10",
    "text": "Be still, and know that I am God: I will be exalted among the nations, I will be exalted in the earth.",
    "translation": "KJV",
    "passage": "Summary: Practice stillness to recognize God's sovereignty. Context: A psalm of trust amid chaos. Application: In busy seasons, pause and re-center on what truly matters.",
    "importance": "Presence & stillness"
  },
  {
    "date": "2025-11-18",
    "reference": "Colossians 3:23",
    "text": "And whatsoever ye do, do it heartily, as to the Lord, and not unto men;",
    "translation": "KJV",
    "passage": "Summary: Work with wholehearted devotion. Context: Paul gives practical advice for daily conduct. Application: Treat everyday tasks as meaningful contributions, not just chores.",
    "importance": "Vocation & daily work"
  },
  {
    "date": "2025-11-19",
    "reference": "James 1:5",
    "text": "If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.",
    "translation": "KJV",
    "passage": "Summary: Ask for wisdom boldly. Context: James encourages practical faith that acts. Application: When unsure, ask for clear guidance and listen patiently for the answer.",
    "importance": "Seeking wisdom in decisions"
  },
  {
    "date": "2025-11-20",
    "reference": "Psalm 37:4",
    "text": "Delight thyself also in the LORD: and he shall give thee the desires of thine heart.",
    "translation": "KJV",
    "passage": "Summary: Joyful alignment with God shapes desires. Context: David contrasts trust with anxious striving. Application: Prioritize what aligns with deeper joy, not fleeting wants.",
    "importance": "Delight & priorities"
  }
]
